模型文件过大[二哈]
动画效果, 开门关门之类的模型动画[需要有开灯, 开门之类的动画]
[完成]obit设置智能横向移动, 或者将其他方向的移动看起来没有违和
[完成]添加点击按钮, 点击可切换皮肤[二哈]
添加点击按钮, 点击可切换模型[二哈]
[完成] 将地板的镜面变的模糊
[完成] 将皮肤变成反光材质
[完成]点击事件, 点击出弹框
移动端适配
毛边


暂缺的东西

地板贴图
vbx模型-可以制作动画,可能大小稍大
json模型-可以制作动画,大小理论上较小
模型普遍较大-一般的模型似乎也并没有那么多的顶点,是不是有其他方法模拟顶点(靠法相贴图(已确认不行),看不见的地方用图片蒙混)

参考资料
https://www.jianshu.com/p/906072e60197
https://blog.csdn.net/lijunfan1994/article/details/52757869


1. 按钮精致
2. 点击按钮事件后静止一段时间
3. 图片改成正式一点的,最好带个×
4. pc事件

5. 对比白鹭3d

今日任务:
支线一:[完成] 完成天空图的切换,模拟进入赛车内部场景 
支线二:等二哈将模型做完,将动画做完,将灯泡的模型附在上面
支线三:整理代码-有时间将其改成MVC